# Pandas (Pannel Data Analysis)
- Used to Manipulation and Data Analysis
- Data Manipulation process used to organise and readable data .
  purpose Consistent Data , Project related Data , create more value from data , Remove or ignore data 
- Types of Data Analyst (Descriptive,diagnostic,predictive,Prescriptive)


- Python module that makes data science easy and effective .
- Process of cleaning messy data is called data wrangling / munging
- 2008 Development of pandas started
- 2009 Pandass become open source

## Series

In [1]:
import pandas as pd
a = [1, 7, 2]
myvar = pd.Series(a)
print(myvar)

# df.to_csv('ccc') ---> used to save the file :)
# df.loc['dex'] ---> returns series 
# df.iloc[:,:]  ---> returns data frame
# df.iloc[:,:].values ----> used to convert dataframe into array
# df.read_csv('t.csv',sep=';') -----> if in csv file there is separator of ; this

0    1
1    7
2    2
dtype: int64

In [2]:
import pandas as pd
dates = pd.date_range("20130101",periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [3]:
import pandas as pd
label = ['i','ii','iii']
a = [1, 7, 2]
myvar = pd.Series(a,index=label)
print(myvar)

i      1
ii     7
iii    2
dtype: int64

In [4]:
import pandas as pd
a = [1, 7, 2]
myvar = pd.Series(a, index = ["x", "y", "z"])
print(myvar)

x    1
y    7
z    2
dtype: int64

In [5]:
import pandas as pd
calories = {"day1": 420, "day2": 380, "day3": 390}
myvar = pd.Series(calories)
print(myvar)
# Key values as label

day1    420
day2    380
day3    390
dtype: int64

# DataFrame 
- DataFrame is the main object in pandas , used to represent data in row and col form

In [6]:
import numpy as np 
import pandas as pd 
dt1 = pd.DataFrame(np.arange(24).reshape(6,4),
                   index=list('ABDCFE'),
                   columns=['red','green','white','Black'])
dt1

   red  green  white  Black
A    0      1      2      3
B    4      5      6      7
D    8      9     10     11
C   12     13     14     15
F   16     17     18     19
E   20     21     22     23

In [7]:
dt1.sort_values(by = ['red','green'])

   red  green  white  Black
A    0      1      2      3
B    4      5      6      7
D    8      9     10     11
C   12     13     14     15
F   16     17     18     19
E   20     21     22     23

In [8]:
dt1.sort_index()

   red  green  white  Black
A    0      1      2      3
B    4      5      6      7
C   12     13     14     15
D    8      9     10     11
E   20     21     22     23
F   16     17     18     19

In [9]:
dt1.sum()

red      60
green    66
white    72
Black    78
dtype: int64

In [10]:
dt1.cumsum()

   red  green  white  Black
A    0      1      2      3
B    4      6      8     10
D   12     15     18     21
C   24     28     32     36
F   40     45     50     55
E   60     66     72     78

In [11]:
# Correlation 
# Measure of strength of a relationship between two variables values lies ( -1 and +1 )
# +ve Correltion ===> if both moves in both direcion. 
# -ve Correltion ===> if one increase other decrease.
# Correlation becomes weaker , when apporaches to zero , stronger (+1,-1)
dt1['red'].corr(dt1['white'])

1.0

In [12]:
dt1.corr()
# Corr matrix show correlation relation between all values in DataFrame

       red  green  white  Black
red    1.0    1.0    1.0    1.0
green  1.0    1.0    1.0    1.0
white  1.0    1.0    1.0    1.0
Black  1.0    1.0    1.0    1.0

In [13]:
# Covariance 
# also examines relation between two variable 
# measures to extend which two variable changes
# Also measures how far the variabe is extended ...
dt1.cov()

        red  green  white  Black
red    56.0   56.0   56.0   56.0
green  56.0   56.0   56.0   56.0
white  56.0   56.0   56.0   56.0
Black  56.0   56.0   56.0   56.0

In [14]:
dt1.drop('A')

   red  green  white  Black
B    4      5      6      7
D    8      9     10     11
C   12     13     14     15
F   16     17     18     19
E   20     21     22     23

In [15]:
dt1.drop('white',axis=1)

   red  green  Black
A    0      1      3
B    4      5      7
D    8      9     11
C   12     13     15
F   16     17     19
E   20     21     23

In [16]:
import numpy as np
import pandas as pd

from numpy.random import randn
np.random.seed(101)
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [17]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [18]:
type(df['W'])

pandas.core.series.Series

In [19]:
type(df)

pandas.core.frame.DataFrame

In [20]:
import pandas as pd
weather_data = {
    'day': ['1/1/2017','1/2/2017','1/3/2017','1/4/2017','1/5/2017','1/6/2017'],
    'temperature': [32,35,28,24,32,31],
    'windspeed': [6,7,2,7,4,2],
    'event': ['Rain', 'Sunny', 'Snow','Snow','Rain', 'Sunny']
}
df = pd.DataFrame(weather_data)
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [21]:
df['day']

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [22]:
df[['day','temperature']]

        day  temperature
0  1/1/2017           32
1  1/2/2017           35
2  1/3/2017           28
3  1/4/2017           24
4  1/5/2017           32
5  1/6/2017           31

In [23]:
# find the max temp in the data set
df['temperature'].max()

35

In [24]:
# set index as day if want to modify this change on 
# orginal data set then type , inplace = True 
df.set_index('day')

          temperature  windspeed  event
day
1/1/2017           32          6   Rain
1/2/2017           35          7  Sunny
1/3/2017           28          2   Snow
1/4/2017           24          7   Snow
1/5/2017           32          4   Rain
1/6/2017           31          2  Sunny

In [25]:
import pandas as pd
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}
#load data into a DataFrame object:
df = pd.DataFrame(data)
print(df)

   calories  duration
0       420        50
1       380        40
2       390        45

In [26]:
#use a list of indexes:
print(df.loc[[0, 1]])

   calories  duration
0       420        50
1       380        40

In [27]:
import pandas as pd

data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

df = pd.DataFrame(data, index = ["day1", "day2", "day3"])

print(df)

      calories  duration
day1       420        50
day2       380        40
day3       390        45

In [28]:
df.columns

Index(['calories', 'duration'], dtype='object')

In [31]:
df['calories']

day1    420
day2    380
day3    390
Name: calories, dtype: int64

In [33]:
df[df.duration<28]

Empty DataFrame
Columns: [calories, duration]
Index: []

In [34]:
#refer to the named index:
print(df.loc["day2"])

calories    380
duration     40
Name: day2, dtype: int64

In [35]:
df.drop('duration',axis=1)
#nor permanently deleted

      calories
day1       420
day2       380
day3       390

In [36]:
df

      calories  duration
day1       420        50
day2       380        40
day3       390        45

In [37]:
df.drop('calories',axis=1,inplace=True) 
df
#permanently deleted

      duration
day1        50
day2        40
day3        45

In [38]:
# data frame created using tuples
weather_data = [
    ('1/1/2017',32,6,'Rain'),
    ('1/2/2017',35,7,'Sunny'),
    ('1/3/2017',28,2,'Snow')
]
df = pd.DataFrame(data=weather_data, columns=['day','temperature','windspeed','event'])
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [39]:
# data frame created using list of list
weather_data = [
    {'day': '1/1/2017', 'temperature': 32, 'windspeed': 6, 'event': 'Rain'},
    {'day': '1/2/2017', 'temperature': 35, 'windspeed': 7, 'event': 'Sunny'},
    {'day': '1/3/2017', 'temperature': 28, 'windspeed': 2, 'event': 'Snow'},
    
]
df = pd.DataFrame(data=weather_data, columns=['day','temperature','windspeed','event'])
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [40]:
# import pandas as pd
# df = pd.read_csv("weather_data.csv",parse_dates=['day'])
# type(df.day[0])
# df
# parse_dates=['day'] used to convert 2022/2/3 ---- 2022-2-3

## Fill the values with Na

In [ ]:
# new_df = df.fillna(0) used to fill 0 in all where NA is in data set
# new_df = df.fillna({'temperature': 0,'windspeed': 0,'event': 'No Event'}) for same above function

In [ ]:
# new_df = df.fillna(method="ffill",limit=1) also used limit parameter 
# used to fill the value forwardfill---ffill eg x ---32 y---0 then x ---32 y---32

## Drop na values

In [ ]:
# new_df = df.dropna() drop all na
# new_df = df.dropna(how='all') drop all na whose
# all col are na same thresh=1

## Replacing value technique

In [ ]:
# new_df = df.replace(-99999, value=np.NaN)
# new_df = df.replace(to_replace=[-99999,-88888], value=0)
# new_df = df.replace({'temperature': -99999,'windspeed': -99999,'event': '0'}, np.nan) ---> used per col
# df = pd.DataFrame({ 'score': ['exceptional','average', 'good', 'poor', 'average', 'exceptional'],
# 'student': ['rob', 'maya', 'parthiv', 'tom', 'julian', 'erica']}) --- replacing list of list
# new_df = df.replace({'temperature': '[A-Za-z]', 'windspeed': '[a-z]'},'', regex=True) replace 7 mph as 7

## Reading dataFrame files
- df = pd.read_csv('weather.csv')
- optionals as sep=',' or header =none or name = ['x','y','z'] or index_col = 'name' or skiprows=[1,2,4]
- df = pd.read_excel('weather.xlxs','Sheet1')
- dictionary can be created as dataset from df = pd.DataFrame(x)

- from os import listdir ----> Returns all files in the directory

## Concating functions

In [ ]:
# df = pd.concat([india_weather, us_weather])  
# df = pd.concat([india_weather, us_weather] , ignore_index=True)
# df = pd.concat([india_weather, us_weather], keys=["india", "us"])

In [ ]:
from io import StringIO, BytesIO

In [ ]:
data = ('colq,col2,col3\n'
       'x,y,1\n'
       'a,b,2\n'
       'c,d,3')

In [ ]:
import pandas as pd

pd.read_csv(StringIO(data))

In [ ]:
# checking x has null values or not 
# x.isna()
# x.isnull()

# filtering na values
# x.dropna() or inplace = true for udate in orginal Dataset.  or axis =1 for col or how = 'All' 
# it means only remove whose totally col is null or thresh = 3 it means remove col or row having mini 3 null values 
# x.notnull()

# Filling the na values
# x.fillna(20)
# x.fillna({say1:20 and so on })
# x.fillna(method = 'ffill') forward filled put same
# x.fillna(method = 'bfill') backward filled put same 

# checking all the dublicates 
# x.dublicated()
# if data set is large diff to check dublicated 
# x.dublicated().Any() return one true if data set have ...
# x.drop_dublicates() // for removing dublicates

# Replacing the values 
# x.replace('999',np.nan,inplace = true)
# x.replace(['333','444','44','999'],np.nan,inplace = true)
# x.replace({'mal':'male','femal':'female'})

# Renaming the col index
# data.rename(index={'x':'xy'},inplace = true)
# data.index.str.upper() used to convert into string 
# str.upper()/lower()/trim()/join()/title/count

# Shuffling dataframe
# data.sample(frac=1) index will be also shuffled 
# data.sample(frac=1).reset_index(drop=True)    for reset shuffled index

In [ ]:
# Data Wrangling 
# Wide range of functions used to prepare the data for further analysis.
# Combining,joining,rearranging data are the part of Data Wrangling and very important in data science
# swaplevel(0,1) used to swap the indexs if we have multiple and sort_index() to sort by index
# merge(d1,d2) optionals on = 's' which is mandartory to include how = 'left/right'
# if d1 as name_state annd d2 as name then merge(d1,d2 right_on='name_state' , left_on='state') 
# concate(d1,d2) optional axis=1 create nan values,axis=1 join ='inner' only all availbe values without nan
# Reshaping includes stacking,pivoting,melting
# Stacking : moving the inner most col index into inner most row index 
# unstacking : moving the inner most row index into inner most col
# melt(): used to transfrom multiple col into single col
# pivot(): used to transfrom single col into multiple col